EDT/УТ/src/Catalogs/новаГеоРайоны/новаГеоРайоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаГеоРайоны</name>
  <owners>Catalog.новаКлассификаторРайонов</owners>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ребра</name>
    <attributes>
      <name>Широта1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаГеоРайоны/ObjectModule.bsl
//**** Обработчики событий объекта ****//

//Расчёт рёбер
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Ребра.Очистить();
	
	КоличествоТочек = Точки.Количество() - 1;
	Если КоличествоТочек < 2 Тогда Возврат; КонецЕсли;
	
	ПредШирота = Точки[0].Широта;
	ПредДолгота = Точки[0].Долгота;
	
	Для ъ = 1 По КоличествоТочек Цикл
		стрРебро = Ребра.Добавить();
		стрРебро.Широта1 = ПредШирота;
		стрРебро.Долгота1 = ПредДолгота;
		стрРебро.Широта2 = Точки[ъ].Широта;
		стрРебро.Долгота2 = Точки[ъ].Долгота;
		
		ПредШирота = Точки[ъ].Широта;
		ПредДолгота = Точки[ъ].Долгота;
	КонецЦикла;
	
	ъ = 0;
	стрРебро = Ребра.Добавить();
	стрРебро.Широта1 = ПредШирота;
	стрРебро.Долгота1 = ПредДолгота;
	стрРебро.Широта2 = Точки[ъ].Широта;
	стрРебро.Долгота2 = Точки[ъ].Долгота;
КонецПроцедуры

//Расчёт принадлежности адресов к георайону, синхронизация с КСЛ
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	

	//Сообщить("Начало обновления привязки адресов к районам...");
	//
	//тзАдресаРайонов = новаКарты.РассчитатьГеоРайоныАдресов(Ссылка,,, Истина);
	//НаборЗаписей = РегистрыСведений.новаРайоныАдресов.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Район.Установить(Ссылка);
	//НаборЗаписей.Отбор.УказанВручную.Установить(Ложь);
	//НаборЗаписей.Загрузить(тзАдресаРайонов);
	//НаборЗаписей.Записать();
	//
	//Сообщить("Обновление районов адресов завершено...");
	
	Попытка
		новаОбменКСЛ.СохранитьГеоРайон(ЭтотОбъект);
	Исключение
		#Если Клиент Тогда			
			новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
		#КонецЕсли
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПередУдалением(Отказ)
	
	Попытка
		новаОбменКСЛ.УдалитьГеоРайон(ЭтотОбъект);
	Исключение
		#Если Клиент Тогда			
			новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
		#КонецЕсли
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры
